---
kind: method
id: M:Autodesk.Revit.DB.FormArray.ReverseIterator
source: html/82d038e6-9a72-dda8-e0e7-a2b41c3e2640.htm
---
# Autodesk.Revit.DB.FormArray.ReverseIterator Method

Retrieve a backward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual FormArrayIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the array.